# AddSeparator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonPanel..::..AddSeparator Method
RibbonPanel Class See Also
---
Adds a new Separator to the panel.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void AddSeparator()
```

Visual Basic
---
```text
Public Sub AddSeparator
```

Visual C++
---
```text
public:
void AddSeparator()
```

# Remarks
The separator won't be shown if there are no items already added to the panel.
# See Also
RibbonPanel Class
Autodesk.Revit.UI Namespace